# meta developer: @SodaModules

import random
from random import choice

from .. import loader, utils

zharty = [
    "— Як називається найдавніша держава геїв?\n— Глиномесопотамія",
    (
        "Перші признаки СНІДа:\n1) Різка біль у задньому проході.\n2) Важке дихання"
        " у потилицю."
    ),
    (
        "Сидять два єврея у туалеті. Один говорить:\n —Скажи Мойша. Ось ми зараз"
        " серемо. Це розумова чи фізична робота?\n— Я думаю, розумова. Якщо б"
        " це була фізична робота, ми таки когось найняли."
    ),
    "— Що зробив канібал торчок?\n— Покурив мальця",
    "Чому Кеннеді не п'є?\nЙого виносить із першого шота.",
    "Маленький одноногий хлопчик підвівся не з тієї ноги і впав.",
    (
        "— Знаєте, чому у маленького сліпого хлопчика впало морозиво?\n— Чому?\n"
        "— Його збила фура."
    ),
    "Вчителька із зарплатою 40$ плаче коли пише на дошці 'класна робота'",
    "Лісник-шахрай розвів багаття",
    "До електричних схилів були скати внутрішнього згоряння.",
    (
        "У садку, після щеплення, діти не викидають ватку, бо від неї пахне"
        " татом."
    ),
    "Пішли мужики до сауни паритися. Парилися-парились та спарились!",
    "Вокзальна повія вийшла заміж за бас-гітариста і скотилася до його рівня.",
    "російські айтішники массово пішли на front end.",
    "В Естонії повністю розкрадено діамантовий фонд: зникли всі три склорізи.",
    "Карлик влаштував п'яну бійку у міні-барі.",
    "— Що таке мінет по-кавказьки?\n— Як і звичайний, лише з аджикою.",
    (
        "Зібралися якось усі гендери та вагітна жінка побитися. Все чесно: два"
        " на два"
    ),
    "Циганська збірна привезла з Олімпіади золото",
    "Один хлопчик випив пива перед підсумковим твором і прийшов на нього готовим",
    "У сім'ї хімікатів сталося горе. Батька нейтралізували.",
    (
         "Три мужики розповідають у кого дружина тупіша. — Моя дура — купила навушники. А"
         " плеєра-то у неї немає! \nВсі сміються.\n— Моя ще тупіша — купила принтер. А"
         "Комп'ютера-то у неї немає!\nВсі регочуть.\n— Це все хуйня, ось моя"
         " презервативів набрала і на море поїхала!\nВсі мовчать.\n— А члена-то у неї"
         " нема!"
    ),
    (
        "Приїхали росіяни до Африки. Залізли в річку, і давай кричати:\n— Ето наша рєка,"
        " потому что ми здєсь рускоговорящиє!\nА крокодилу похер було, чим обідати!"
    ),
    (
        "Прочитав тривожне повідомлення: Нацполіція шукає вбивцю росіян."
        " Ось тепер думаю — може це вакансія?"
    ),
    "— Чим різниться труп збитої собаки і москаля?\n— Чим?\n— Перед собакою є тормозний слід.",
    "Іспанець Сантьяго побував в московії. Деякі речі його здивували, деякі обурили, а деякі в нього поцупили.",
    (
        "Заходить якось москаль з папугою в бар. Бармен запитує:\n"
        "— Де купив?\n Папуга відповідає:\n— На ринку"
    ),
    "В російських школах відключать дзвінки, щоб діти не чекали «пєрємєн»",
    "У Львові провели олімпіаду з російської мови. Переможців розстріляли...",
    (
        "Приходить наркоман у ресторан:\n— Що у вас у меню?\n"
        "— Один момент...\n— О! Мені два тюбики!"
    ),
    "Вірменин, відчинивши дверцята шафи, знайшов вхід до Нардії.",
    "— Капітане! Земля!\n— Ми ще не відплили, єблан",
    "В Іраку пройшов турнір із CS2. Терористи виграли.",
    (
        "Хлопчик, який вміє читати думки, програв у покер дівчинці, яка не вміє"
        " думати."
    ),
    "Приходить Гуччіо Гуччі до італійського будинку моди, а там Armani у нарди грає",
    (
        "На дивані лежав п'яний Андрійко, і в ньому боролися двоє людей: один хотів"
        " спати, інший серити. Перемогли обидва."
    ),
    "Німий аквалангіст Василь прочитав по губах білої акули, що йому пиздець",
    "Репер з діареєю зачитав дрістайл",
    "Грузин – порноактор назвав свого сина Камшот.",
    "Привозять карлика до лікарні, а в нього мікроінсульт.",
    "Якщо годинник зі зозулею перевернути обличчям до стіни вийдуть годинник з дятлом.",
    "Гестапо обклало всі виходи... Але Штірліц вийшов через вхід",
    "Нещодавно пройшов чемпіонат світу з логіки. Переміг переможець, подарували подарунок.",
    "Тренер камікадзе:\n— Дивись, показую 1 раз",
    "Сталкер почув за собою хвіст.\n«Мутую», – подумав сталкер.",
    "Хлопчик із спритними сідницями відбирає у батька ремінь під час шмагання.",
    "Приходять два похуїсти в музичний магазин і кажуть: 'Нам по барабану.'",
    "Педофіл-канібал, ось начебто доросла людина, а всередині дитина.",
    (
        "Винахідливий батько, щоб дізнатися, чи матюкається його син, вдарив його"
        " по пальцях молотоком"
    ),
    (
        "— Чоловіче, не пий! Москалі воду отруїли!\n"
        "— Што ти гаваріш?\n"
        "— Я говорю: пий мєдлено, вода холодна, горло застудиш."
    ),
    "Програмісти розуміють анекдоти лише категорії C++",
    "Колобок повісився, Буратіно втопився, негр помер своєю смертю.",
    "У вірменського математика народився син. Назвали Графік.",
    "Іде миша квартирою, бачить — холодильник порожній. Залізла в нього та повісилася.",
    "— Людо, Людо, Людольфе, вибач",
    (
        "Якщо під час сексу ляскати пухирчасту плівку, можна померти від передозування"
        " гормоном щастя"
    ),
]


@loader.tds
class Zharty(loader.Module):
    """Відправляє рандомний анекдот."""

    strings = {"name": "Жарти"}

    @loader.command()
    async def Жарт(self, m):
        "- видати рандомний анекдот."
        randomjumor = random.choice(zharty)
        await utils.answer(m, f"<b>{randomjumor}</b>")
